performance-test-reports/automated-security-tests/12617194467/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2025-01-05T06:22:47Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 334507 / ✗ 6763
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 2219
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1465
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3079

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 334507 / ✗ 6763
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 334507 / ✗ 6763
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6763    7.624976/s
-    _response_success_cnt..........: 334507  377.141478/s
-    _response_total_cnt............: 341270  384.766454/s
-    checks.........................: 99.33%  ✓ 4041136     ✗ 27052 
-    data_received..................: 120 MB  135 kB/s
-    data_sent......................: 80 MB   90 kB/s
-    dropped_iterations.............: 1620759 1827.332297/s
-    group_duration.................: avg=902.92ms min=243.96µs med=2.31ms   max=1m0s    p(90)=1.26s    p(95)=2.49s   
-    http_req_blocked...............: avg=468.29ms min=0s       med=171.37µs max=19.59s  p(90)=1.02s    p(95)=2.05s   
-    http_req_connecting............: avg=468.24ms min=0s       med=132.67µs max=19.59s  p(90)=1.02s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.2s     min=0s       med=247.03ms max=59.99s  p(90)=755.61ms p(95)=1.52s   
-      { expected_response:true }...: avg=533.12ms min=806.7µs  med=246.7ms  max=58.83s  p(90)=658.6ms  p(95)=1.19s   
-  ✗ http_req_failed................: 1.98%   ✓ 6763        ✗ 334507
-    http_req_receiving.............: avg=414.81µs min=0s       med=76.13µs  max=63.76ms p(90)=1ms      p(95)=1.81ms  
-    http_req_sending...............: avg=140.76µs min=0s       med=32.65µs  max=63.92ms p(90)=142.75µs p(95)=266.79µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.2s     min=0s       med=246.48ms max=59.99s  p(90)=754.81ms p(95)=1.51s   
-    http_reqs......................: 341270  384.766454/s
-    iteration_duration.............: avg=1.8s     min=2.94ms   med=254.01ms max=1m0s    p(90)=2.5s     p(95)=5.37s   
-    iterations.....................: 341270  384.766454/s
-    vus............................: 3       min=0         max=1000
-    vus_max........................: 1000    min=396       max=1000